app/sidekiq/scraper_job.rb

  def perform(url, user_listing_id = nil)
    options = Selenium::WebDriver::Firefox::Options.new
    options.add_argument('--headless')
    driver = Selenium::WebDriver.for(:firefox, options: options)

    driver.navigate.to url
    sleep 4

    airbnb_listing_id = driver.current_url.match(%r{/\d+\?})[0].gsub(/\d+/).first
    title = driver.find_element(css: "div[data-section-id='TITLE_DEFAULT'] h1").text

    # Create or get listing
    listing = Listing.find_or_create_by(airbnb_id: airbnb_listing_id) do |li|
---
INSERT INTO "listings" ("url", "name", "airbnb_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"
SELECT "listings".* FROM "listings" WHERE "listings"."airbnb_id" = ? LIMIT ?  [["airbnb_id", "52596108"], ["LIMIT", 1]]

      sleep 1
    end

    existing_review_ids = listing.reviews.collect(&:airbnb_review_id)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."listing_id" = ?  [["listing_id", 1]]

      # rating = review.find_element(css: 'div div div span').text.gsub(/\d/).first.to_i
      review_text = review.find_element(css: 'div div div span span').text

      listing.reviews.create author: author, text: review_text, airbnb_review_id: review_id, date: Date.today
---
INSERT INTO "reviews" ("author", "text", "date", "airbnb_review_id", "listing_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    # Save or process the extracted data
    logger.info("Scraping completed for listing #{listing.airbnb_id}")

    UserListing.find(user_listing_id).update!(listing: listing, pending: false) if user_listing_id.present?
---
SELECT "user_listings".* FROM "user_listings" WHERE "user_listings"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "user_listings" SET "listing_id" = ?, "pending" = ?, "updated_at" = ? WHERE "user_listings"."id" = ?  [["listing_id", 1], ["pending", 0], ["updated_at", "2024-12-02 19:46:22.277651"], ["id", 5]]