app/views/user_listings/show.html.erb


  <% @user_listing.listing.reviews.each do |review| %>
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."listing_id" = ?  [["listing_id", 1]]