app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"
---
  def index
    @listing = Listing.new
    @listings = Listing.all

INSERT INTO "listings" ("url", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"
---
  def create
    @listing = Listing.new(listing_params)

    respond_to do |format|
      if @listing.save