app/controllers/user_listings_controller.rb

SELECT COUNT(*) FROM "user_listings" WHERE "user_listings"."listing_id" = ?  [["listing_id", 1]]
---
  def destroy
    @user_listing.listing.destroy! if @user_listing.listing.user_listings.count == 1