app/controllers/user_listings_controller.rb

  def index
    @user_listing = UserListing.new
    @user_listings = current_user.user_listings.all
---
SELECT "user_listings".* FROM "user_listings" WHERE "user_listings"."user_id" = ?  [["user_id", 2]]

  def show
    grouped_data = @user_listing.listing.reviews.group_by { |r| r.created_at.strftime('%B %Y') }
    @chart_labels = grouped_data.keys
    @chart_values = grouped_data.values.map(&:count)
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."listing_id" = ? ORDER BY "reviews"."created_at" ASC  [["listing_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."listing_id" = ?  [["listing_id", 1]]

  def create
    @user_listing = current_user.user_listings.create user_listing_params
    @user_listings = UserListing.all
---
INSERT INTO "user_listings" ("user_id", "listing_id", "pending", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "user_listings".* FROM "user_listings"

  def destroy
    @user_listing.destroy!
---
DELETE FROM "user_listings" WHERE "user_listings"."id" = ?  [["id", 7]]

  def set_user_listing
    @user_listing = UserListing.find(params[:id])
---
SELECT "user_listings".* FROM "user_listings" WHERE "user_listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]